Revit 2027 API
NumberingSchema.AddMatchingParameter Method
 Add a new parameter to the matching criteria for this numbering schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddMatchingParameter(
	NumberingParameter numberingParameter
)
Public Sub AddMatchingParameter (
	numberingParameter As NumberingParameter
)
public:
void AddMatchingParameter(
	NumberingParameter^ numberingParameter
)
member AddMatchingParameter :
        numberingParameter : NumberingParameter -> unit
Parameters
numberingParameter NumberingParameter
 Parameter to add to the matching criteria.
Exceptions
Exception | Condition
ArgumentException |  The input parameter is not valid for use in matching for numbering.
ArgumentNullException |  A non-optional argument was null
Remarks
 This method makes sure that the document will be consistent when it comes to numbering before it exits.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace